erp3l/src/Catalogs/КатегорииПолучателейСтимулирующихВыплатФСС/КатегорииПолучателейСтимулирующихВыплатФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииПолучателейСтимулирующихВыплатФСС</name>
  <attributes>
    <name>ПолучательСтимулирующихВыплатФСС</name>
    <type>
      <types>EnumRef.ПолучательСтимулирующихВыплатФСС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКатегории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОказываетМедицинскуюПомощьCOVID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/КатегорииПолучателейСтимулирующихВыплатФСС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение:
//  Массив(Строка) - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	Результат.Добавить("НаименованиеКатегории");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("НаименованиеКатегории");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон(НСтр("ru = '(%1) %2';
									|en = '(%1) %2'"), Данные.Код, Данные.НаименованиеКатегории);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ
	
Функция ТаблицаКлассификатора()
	
	ТаблицаКлассификатора = Новый ТаблицаЗначений;
	ТаблицаКлассификатора.Колонки.Добавить("Код");
	ТаблицаКлассификатора.Колонки.Добавить("НаименованиеКатегории");
	ТаблицаКлассификатора.Колонки.Добавить("ПолучательСтимулирующихВыплатФСС");
	ТаблицаКлассификатора.Колонки.Добавить("ОказываетМедицинскуюПомощьCOVID");
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "1";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач';
															|en = 'Doctor'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "2";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, в том числе фельдшер, медицинский дезинфектор, лаборант, медицинская сестра по массажу, медицинская сестра процедурной, медицинская сестра по физиотерапии, старшая медицинская сестра, инструктор по лечебной физкультуре, инструктор-методист по лечебной физкультуре';
															|en = 'Nursing staff, including a paramedic, a medical disinfector, a laboratory assistant, a massage nurse, a procedure room nurse, a physiotherapy nurse, a head nurse, a physical therapy instructor, a physical therapy methodology instructor'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "3";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Социальный работник, специалист по социальной работе, специалист по работе с семьей, специалист по реабилитационной работе в социальной сфере, психолог в социальной сфере, педагогический работник, в том числе воспитатель, инструктор по труду, логопед, музыкальный руководитель, педагог-библиотекарь, педагог-организатор, педагог-психолог, социальный педагог, педагог-дефектолог, учитель-логопед, административно-управленческий персонал';
															|en = 'Social worker, specialist in social work, specialist in family work, specialist in rehabilitation work in the social sphere, psychologist in the social sphere, teacher, including educator, labor instructor, speech therapist, music teacher, librarian-teacher, facilitator, psychologist-teacher, social teacher, special educator, speech therapist-teacher, administrative and managerial staff'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "4";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинскоий персонал, в том числе сестра-хозяйка, санитар, сиделка (помощник по уходу), - в случае невыявления в стационарной организации социального обслуживания, стационарном отделении новой коронавирусной инфекции (COVID-19) 15 тыс. рублей, в случае выявления - 20 тыс. рублей';
															|en = 'Junior medical personnel, including a matron, a nurse, a practical nurse (care assistant), in case of failure to detect a new coronavirus infection (COVID-19) in a permanent social service company, an inpatient business unit - 15 thousand rubles, if detected - 20 thousand rubles'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "5";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Технический персонал, персонал, занятый на иных должностях';
															|en = 'Technical personnel, personnel employed in other positions'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "11";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, оказывающий скорую медицинскую помощь, выездной бригады скорой медицинской помощи';
															|en = 'Doctor providing emergency medical assistance in a mobile ambulance team'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "12";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, оказывающий специализированную медицинскую помощь в стационарных условиях';
															|en = 'Physician providing specialized medical care in inpatient setting'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "13";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, оказывающий первичную медико-санитарную помощь';
															|en = 'Primary care physician'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "14";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач патолого-анатомического бюро (отделения медицинской организации), проводящий  патолого-анатомические исследования, связанные с новой коронавирусной инфекцией (COVID-19)';
															|en = 'Doctor of the pathology and anatomical bureau (business unit of a medical company) conducting pathological and anatomical studies related to the new coronavirus infection (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "15";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей';
															|en = 'Physician who does not provide medical care for the diagnosis and treatment of a new coronavirus infection COVID-19 and contacts a patient with an established diagnosis of a new coronavirus infection COVID-19 in the performance of official duties'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "22";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием, оказывающий специализированную медицинскую помощь в стационарных условиях';
															|en = 'Medical worker with higher (non-medical) education, providing specialized medical care in impatient setting'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "23";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием, оказывающий первичную медико-санитарную помощь';
															|en = 'Medical worker with a higher (non-medical) education, providing primary health care'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "24";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием патолого-анатомического бюро (отделения медицинской организации), проводящий  патолого-анатомические исследования, связанные с новой коронавирусной инфекцией (COVID-19)';
															|en = 'Medical worker with a higher (non-medical) education in the pathology and anatomical bureau (business unit of a medical company) conducting pathological and anatomical studies related to the new coronavirus infection (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "25";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей';
															|en = 'Medical worker with a higher (non-medical) education who does not provide medical care for the diagnosis and treatment of a new coronavirus infection COVID-19 and contacts a patient with an established diagnosis of a new coronavirus infection COVID-19 in the performance of official duties'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "31";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, участвующий в оказании скорой медицинской помощи';
															|en = 'Nursing personnel involved in the provision of emergency medical services'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "32";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, участвующий в оказании медицинской помощи в стационарных условиях';
															|en = 'Nursing personnel involved in the provision of medical care in inpatient setting'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "33";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, участвующий в оказании первичной медико-санитарной помощи';
															|en = 'Nursing personnel involved in primary health care'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "34";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал патолого-анатомического бюро (отделения медицинской организации), проводящий (обеспечивающий условия для проведения) патолого-анатомические исследования, связанные с новой коронавирусной инфекцией (COVID-19)';
															|en = 'Nursing personnel of the pathology and anatomical bureau (business unit of a medical company) conducting (ensuring the conditions for conducting) pathological and anatomical studies related to the new coronavirus infection (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "35";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей';
															|en = 'Nursing personnel who does not provide medical care for the diagnosis and treatment of a new coronavirus infection COVID-19 and contacts a patient with an established diagnosis of a new coronavirus infection COVID-19 in the performance of official duties'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "41";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, обеспечивающий оказание скорой медицинской помощи, выездной бригады скорой медицинской помощи';
															|en = 'Junior medical personnel, providing emergency medical care, in a mobile ambulance crew'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "42";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, обеспечивающий оказание специализированной медицинской помощи в стационарных условиях';
															|en = 'Junior medical personnel providing specialized medical care in inpatient setting'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "43";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, обеспечивающий оказание первичной медико-санитарной медицинской помощи в амбулаторных условиях';
															|en = 'Junior medical personnel providing primary health care on outpatient basis'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "44";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал патолого-анатомического бюро  (отделения медицинской организации) , обеспечивающий условия) для проведения патолого-анатомических исследований, связанных с новой коронавирусной инфекцией (COVID-19)';
															|en = 'Junior medical personnel of the pathological and anatomical bureau (business unit of a medical company), providing conditions) for conducting pathological and anatomical studies related to the new coronavirus infection (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "45";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей';
															|en = 'Junior medical personnel who does not provide medical care for the diagnosis and treatment of a new coronavirus infection COVID-19 and contacts a patient with an established diagnosis of a new coronavirus infection COVID-19 in the performance of official duties'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "51";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Водитель машины выездной бригады скорой медицинской помощи';
															|en = 'Ambulance team driver'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "61";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Водитель машины выездной бригады скорой медицинской помощи, занятый в организации, предоставляющей транспортные услуги';
															|en = 'Ambulance mobile crew driver employed by a company providing transportation services'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "71";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Член летного экипажа санитарной авиации, осуществляющий медицинскую эвакуацию пациентов с новой коронавирусной инфекцией (COVID-19)';
															|en = 'Air ambulance flight crew member providing medical evacuation of patients with new coronavirus infection (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "81";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Член летного экипажа санитарной авиации, занятый в организации, предоставляющей транспортные услуги осуществляющий медицинскую эвакуацию пациентовс новой коронавирусной инфекцией (COVID-19)';
															|en = 'Air ambulance flight crew member employed by a transportation company providing medical evacuation of patients with new coronavirus infection (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "91";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Фельдшер (медицинская сестра) по приему вызовов скорой медицинской помощи и передаче их выездным бригадам скорой медицинской помощи';
															|en = 'Paramedic (nurse) for receiving ambulance calls and transferring them to field ambulance teams'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;

	Возврат ТаблицаКлассификатора;
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ОбновитьСправочникИзКлассификатора();
	
КонецПроцедуры	

Процедура ОбновитьСправочникИзКлассификатора()
	
	ТаблицаКлассификатора = ТаблицаКлассификатора();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииПолучателейСтимулирующихВыплатФСС.Код КАК Код,
	|	КатегорииПолучателейСтимулирующихВыплатФСС.НаименованиеКатегории КАК НаименованиеКатегории,
	|	КатегорииПолучателейСтимулирующихВыплатФСС.Ссылка,
	|	ЛОЖЬ КАК Актуален
	|ИЗ
	|	Справочник.КатегорииПолучателейСтимулирующихВыплатФСС КАК КатегорииПолучателейСтимулирующихВыплатФСС
	|ГДЕ
	|	НЕ КатегорииПолучателейСтимулирующихВыплатФСС.ПометкаУдаления";
	
	ТаблицаСуществующих = Запрос.Выполнить().Выгрузить();
	ТаблицаСуществующих.Индексы.Добавить("Код");
	
	Для Каждого СтрокаКлассификатора Из ТаблицаКлассификатора Цикл
		
		НайденныйЭлемент = ТаблицаСуществующих.Найти(СтрокаКлассификатора.Код, "Код");
		
		Если НайденныйЭлемент = Неопределено Тогда
			СправочникОбъект = Справочники.КатегорииПолучателейСтимулирующихВыплатФСС.СоздатьЭлемент();
		Иначе
			СправочникОбъект = НайденныйЭлемент.Ссылка.ПолучитьОбъект();
			НайденныйЭлемент.Актуален = Истина;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаКлассификатора); 
		СправочникОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
		
	КонецЦикла;
	
	НеАктуальныеКатегории = ТаблицаСуществующих.НайтиСтроки(Новый Структура("Актуален",Ложь));
	Для Каждого НеАктуальнаяКатегория Из НеАктуальныеКатегории Цикл
		СправочникОбъект = НеАктуальнаяКатегория.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ОбновлениеИнформационнойБазы.УдалитьДанные(СправочникОбъект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#КонецЕсли
